app/views/works/_form.html.erb

					<%= f.label :Assign_to_which_composer_for_bespoke?, class: "formLabel" %><br/>
					<%= f.collection_select :artist_id, Artist.all, :id, :name, :include_blank => true %><br/><br/>
---
SELECT "artists".* FROM "artists"