app/controllers/announcements_controller.rb

INSERT INTO "announcements" ("created_at", "description", "facebook_image_content_type", "facebook_image_file_name", "facebook_image_file_size", "facebook_image_updated_at", "homepage_title", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "is_announcement", "is_artist", "is_sound", "is_work", "large_image_content_type", "large_image_file_name", "large_image_file_size", "large_image_updated_at", "latest", "slug", "soundcloud", "square_image_content_type", "square_image_file_name", "square_image_file_size", "square_image_updated_at", "updated_at", "vimeo") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @announcement = Announcement.create(params[:announcement])