app/controllers/works_controller.rb

SELECT "works".* FROM "works" WHERE "works"."id" = ? LIMIT 1  [["id", "1"]]
---
    def show
      bring_in_models
      @work = Work.find(params[:id])

SELECT "works".* FROM "works" WHERE "works"."id" = ? LIMIT 1  [["id", "35"]]
---
    def edit
      bring_in_models
      @work = Work.find(params[:id])

SELECT "works".* FROM "works" WHERE "works"."id" = ? LIMIT 1  [["id", "35"]]
UPDATE "works" SET "client" = '', "vimeo" = '', "description" = '', "grid_square_image_file_name" = 'Chrylser_200__Research_More_Than_Just_The_Car_(400X400).jpg', "grid_square_image_content_type" = 'image/jpeg', "grid_square_image_file_size" = 167837, "grid_square_image_updated_at" = '2016-02-09 14:24:39.205539', "facebook_image_file_name" = 'Chrylser_200__Research_More_Than_Just_The_Car_(2630X1200).jpg', "facebook_image_content_type" = 'image/jpeg', "facebook_image_file_size" = 526421, "facebook_image_updated_at" = '2016-02-09 14:24:39.305333', "updated_at" = '2016-02-09 14:24:39.572717' WHERE "works"."id" = 25
---
    def update
      @work = Work.find(params[:id])
      if @work.update_attributes(params[:work])

SELECT "works".* FROM "works" WHERE "works"."id" = ? LIMIT 1  [["id", "16"]]
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 16]]
---
    def destroy
      @work = Work.find(params[:id])
      @work.destroy